; ModuleID = 'echo'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.option = type { i8*, i32, i32*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.static_info = type { i32, i32, [512 x i8*] }
%struct.clump = type { i64, i64, [3 x %struct.anon.52] }
%struct.anon.52 = type { i64, i8* }
%struct.kp_ht_entry_struct = type { i8*, %struct.kp_vt_struct* }
%struct.kp_vt_struct = type { %struct.kp_kvstore_struct*, i8*, i64, i64, %struct.vector_*, %union.pthread_mutex_t*, i32 }
%struct.kp_kvstore_struct = type { i32, i64, %struct.kp_gc_struct*, %struct.hash_table*, %union.pthread_rwlock_t*, i8, i8, i8, i64, %struct.vector_*, %union.pthread_mutex_t*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "kp_ht_hasher", scope: !2, file: !3, line: 288, type: !283, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !280, nameTableKind: None)
!3 = !DIFile(filename: "kp_kvstore.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ds_state_enum", file: !6, line: 53, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./kp_recovery.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "STATE_ALLOCATED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "STATE_ACTIVE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "STATE_DEAD", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "commit_state_enum", file: !13, line: 498, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./kp_kvstore_internal.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "ALLOCATED", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "CREATED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "CREATED_OK", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "INPROGRESS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "INPROGRESS_OK", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "WAIT_TO_COMMIT", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "COMMITTED", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "WAIT_TO_ABORT", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "ABORTED", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "UNDEFINED", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "DEAD", value: 10, isUnsigned: true)
!26 = !{!27, !152, !154, !155, !156, !46, !157, !158, !222, !230, !50, !266, !279, !48, !271}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "kp_ht_entry", file: !13, line: 60, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kp_ht_entry_struct", file: !13, line: 57, size: 128, elements: !30)
!30 = !{!31, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !29, file: !13, line: 58, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !29, file: !13, line: 59, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "kp_vt", file: !13, line: 44, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kp_vt_struct", file: !3, line: 113, size: 448, elements: !39)
!39 = !{!40, !146, !147, !148, !149, !150, !151}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !38, file: !3, line: 114, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "kp_kvstore", file: !13, line: 42, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kp_kvstore_struct", file: !3, line: 65, size: 640, elements: !44)
!44 = !{!45, !47, !51, !100, !105, !135, !136, !137, !138, !139, !144, !145}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !43, file: !3, line: 66, baseType: !46, size: 32)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pairs_count", scope: !43, file: !3, line: 67, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !49, line: 55, baseType: !50)
!49 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !43, file: !3, line: 68, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "kp_gc", file: !3, line: 54, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kp_gc_struct", file: !3, line: 189, size: 576, elements: !55)
!55 = !{!56, !58, !59, !64, !65, !66, !67, !68, !98}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvm", scope: !54, file: !3, line: 190, baseType: !57, size: 8)
!57 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "last_gc_snapshot", scope: !54, file: !3, line: 191, baseType: !48, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "snapshots_in_use", scope: !54, file: !3, line: 192, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector64", file: !62, line: 34, baseType: !63)
!62 = !DIFile(filename: "vector-cdds/vector64.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "vector64_", file: !62, line: 33, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cps_to_keep", scope: !54, file: !3, line: 193, baseType: !60, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cps_collectable", scope: !54, file: !3, line: 194, baseType: !60, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cps_to_collect", scope: !54, file: !3, line: 195, baseType: !60, size: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cps_collected", scope: !54, file: !3, line: 196, baseType: !60, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !54, file: !3, line: 197, baseType: !69, size: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !71, line: 128, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!72 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 90, size: 320, elements: !73)
!73 = !{!74, !92, !96}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !72, file: !71, line: 125, baseType: !75, size: 320)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !71, line: 92, size: 320, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !84, !85}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !75, file: !71, line: 94, baseType: !46, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !75, file: !71, line: 95, baseType: !7, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !75, file: !71, line: 96, baseType: !46, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !75, file: !71, line: 98, baseType: !7, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !75, file: !71, line: 102, baseType: !46, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !75, file: !71, line: 104, baseType: !83, size: 16, offset: 160)
!83 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !75, file: !71, line: 105, baseType: !83, size: 16, offset: 176)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !75, file: !71, line: 106, baseType: !86, size: 128, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !71, line: 79, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !71, line: 75, size: 128, elements: !88)
!88 = !{!89, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !87, file: !71, line: 77, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !87, file: !71, line: 78, baseType: !90, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !72, file: !71, line: 126, baseType: !93, size: 320)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 320, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 40)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !72, file: !71, line: 127, baseType: !97, size: 64)
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !54, file: !3, line: 198, baseType: !99, size: 32, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ds_state", file: !6, line: 57, baseType: !5)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !43, file: !3, line: 69, baseType: !101, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !103, line: 81, baseType: !104)
!103 = !DIFile(filename: "hash_table/hash.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !103, line: 79, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rwlock", scope: !43, file: !3, line: 70, baseType: !106, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !71, line: 222, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 174, size: 448, elements: !109)
!109 = !{!110, !130, !134}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !108, file: !71, line: 200, baseType: !111, size: 448)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !108, file: !71, line: 177, size: 448, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !123, !128, !129}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !111, file: !71, line: 179, baseType: !46, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !111, file: !71, line: 180, baseType: !7, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !111, file: !71, line: 181, baseType: !7, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !111, file: !71, line: 182, baseType: !7, size: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !111, file: !71, line: 183, baseType: !7, size: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !111, file: !71, line: 184, baseType: !7, size: 32, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !111, file: !71, line: 185, baseType: !46, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !111, file: !71, line: 186, baseType: !46, size: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !111, file: !71, line: 187, baseType: !122, size: 8, offset: 256)
!122 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !111, file: !71, line: 192, baseType: !124, size: 56, offset: 264)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 56, elements: !126)
!125 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !{!127}
!127 = !DISubrange(count: 7)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !111, file: !71, line: 195, baseType: !50, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !111, file: !71, line: 198, baseType: !7, size: 32, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !108, file: !71, line: 220, baseType: !131, size: 448)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 448, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 56)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !108, file: !71, line: 221, baseType: !97, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "is_master", scope: !43, file: !3, line: 71, baseType: !57, size: 8, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvm", scope: !43, file: !3, line: 72, baseType: !57, size: 8, offset: 328)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "detect_conflicts", scope: !43, file: !3, line: 73, baseType: !57, size: 8, offset: 336)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "global_snapshot", scope: !43, file: !3, line: 74, baseType: !48, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "commit_log", scope: !43, file: !3, line: 77, baseType: !140, size: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector", file: !142, line: 31, baseType: !143)
!142 = !DIFile(filename: "vector-cdds/vector.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "vector_", file: !142, line: 30, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "snapshot_lock", scope: !43, file: !3, line: 78, baseType: !69, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !43, file: !3, line: 79, baseType: !99, size: 32, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !38, file: !3, line: 115, baseType: !32, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ver_count", scope: !38, file: !3, line: 116, baseType: !48, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, file: !3, line: 117, baseType: !48, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "vtes", scope: !38, file: !3, line: 126, baseType: !140, size: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !38, file: !3, line: 127, baseType: !69, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !38, file: !3, line: 128, baseType: !99, size: 32, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !153, line: 62, baseType: !50)
!153 = !DIFile(filename: "llvm_compiler8/lib/clang/8.0.0/include/stddef.h", directory: "/home/aksun")
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!157 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "stat_accumulator_t", file: !3, line: 201, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat_accumulator", file: !3, line: 203, size: 576, elements: !161)
!161 = !{!162, !217, !218, !219, !220, !221, !223, !224, !225, !226, !227, !228, !229}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !160, file: !3, line: 204, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !165, line: 48, baseType: !166)
!165 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !167, line: 241, size: 1728, elements: !168)
!167 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !189, !190, !191, !192, !195, !197, !198, !202, !205, !207, !208, !209, !210, !211, !212, !213}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !166, file: !167, line: 242, baseType: !46, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !166, file: !167, line: 247, baseType: !156, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !166, file: !167, line: 248, baseType: !156, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !166, file: !167, line: 249, baseType: !156, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !166, file: !167, line: 250, baseType: !156, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !166, file: !167, line: 251, baseType: !156, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !166, file: !167, line: 252, baseType: !156, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !166, file: !167, line: 253, baseType: !156, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !166, file: !167, line: 254, baseType: !156, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !166, file: !167, line: 256, baseType: !156, size: 64, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !166, file: !167, line: 257, baseType: !156, size: 64, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !166, file: !167, line: 258, baseType: !156, size: 64, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !166, file: !167, line: 260, baseType: !182, size: 64, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !167, line: 156, size: 192, elements: !184)
!184 = !{!185, !186, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !183, file: !167, line: 157, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !183, file: !167, line: 158, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !183, file: !167, line: 162, baseType: !46, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !166, file: !167, line: 262, baseType: !187, size: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !166, file: !167, line: 264, baseType: !46, size: 32, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !166, file: !167, line: 268, baseType: !46, size: 32, offset: 928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !166, file: !167, line: 270, baseType: !193, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !194, line: 131, baseType: !97)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !166, file: !167, line: 274, baseType: !196, size: 16, offset: 1024)
!196 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !166, file: !167, line: 275, baseType: !122, size: 8, offset: 1040)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !166, file: !167, line: 276, baseType: !199, size: 8, offset: 1048)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !166, file: !167, line: 280, baseType: !203, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !167, line: 150, baseType: null)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !166, file: !167, line: 289, baseType: !206, size: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !194, line: 132, baseType: !97)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !166, file: !167, line: 297, baseType: !154, size: 64, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !166, file: !167, line: 298, baseType: !154, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !166, file: !167, line: 299, baseType: !154, size: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !166, file: !167, line: 300, baseType: !154, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !166, file: !167, line: 302, baseType: !152, size: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !166, file: !167, line: 303, baseType: !46, size: 32, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !166, file: !167, line: 305, baseType: !214, size: 160, offset: 1568)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 20)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "detailed", scope: !160, file: !3, line: 205, baseType: !57, size: 8, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vt_touched", scope: !160, file: !3, line: 207, baseType: !46, size: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "max_vt_versions", scope: !160, file: !3, line: 208, baseType: !46, size: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "min_vt_versions", scope: !160, file: !3, line: 209, baseType: !46, size: 32, offset: 160)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "avg_vt_versions", scope: !160, file: !3, line: 210, baseType: !222, size: 32, offset: 192)
!222 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "max_gvn_alive", scope: !160, file: !3, line: 212, baseType: !46, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "min_gvn_alive", scope: !160, file: !3, line: 213, baseType: !46, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "total_versions_alive", scope: !160, file: !3, line: 215, baseType: !46, size: 32, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_current_versions", scope: !160, file: !3, line: 216, baseType: !97, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_old_versions", scope: !160, file: !3, line: 217, baseType: !97, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_metadata", scope: !160, file: !3, line: 218, baseType: !97, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_wasted", scope: !160, file: !3, line: 219, baseType: !97, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "kp_commit_record", file: !13, line: 525, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kp_commit_record_struct", file: !3, line: 134, size: 576, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !261, !262, !263, !265}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvm", scope: !232, file: !3, line: 135, baseType: !57, size: 8)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "begin_snapshot", scope: !232, file: !3, line: 136, baseType: !48, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "end_snapshot", scope: !232, file: !3, line: 137, baseType: !48, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "kvpairs", scope: !232, file: !3, line: 138, baseType: !140, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "state_lock", scope: !232, file: !3, line: 144, baseType: !69, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state_cond", scope: !232, file: !3, line: 145, baseType: !240, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !71, line: 154, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 139, size: 384, elements: !243)
!243 = !{!244, !255, !259}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !242, file: !71, line: 151, baseType: !245, size: 384)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !71, line: 141, size: 384, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !245, file: !71, line: 143, baseType: !46, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !245, file: !71, line: 144, baseType: !7, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !245, file: !71, line: 145, baseType: !157, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !245, file: !71, line: 146, baseType: !157, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !245, file: !71, line: 147, baseType: !157, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !245, file: !71, line: 148, baseType: !154, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !245, file: !71, line: 149, baseType: !7, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !245, file: !71, line: 150, baseType: !7, size: 32, offset: 352)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !242, file: !71, line: 152, baseType: !256, size: 384)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 384, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 48)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !242, file: !71, line: 153, baseType: !260, size: 64)
!260 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "conflict_key", scope: !232, file: !3, line: 146, baseType: !32, size: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next_cr", scope: !232, file: !3, line: 147, baseType: !230, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !232, file: !3, line: 148, baseType: !264, size: 32, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "commit_state", file: !13, line: 510, baseType: !12)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "debug_signalled", scope: !232, file: !3, line: 149, baseType: !57, size: 8, offset: 544)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "kp_vte", file: !3, line: 105, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kp_vte_", file: !3, line: 92, size: 448, elements: !269)
!269 = !{!270, !273, !274, !275, !276, !277, !278}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !268, file: !3, line: 98, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !268, file: !3, line: 99, baseType: !152, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "lvn", scope: !268, file: !3, line: 100, baseType: !48, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !268, file: !3, line: 101, baseType: !48, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "snapshot", scope: !268, file: !3, line: 102, baseType: !48, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "cr", scope: !268, file: !3, line: 103, baseType: !230, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !268, file: !3, line: 104, baseType: !99, size: 32, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !49, line: 40, baseType: !97)
!280 = !{!281, !0}
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "kp_kvstore_count", scope: !2, file: !3, line: 83, type: !46, isLocal: true, isDefinition: true)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !103, line: 55, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!152, !271, !152}
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "kp_local_id_count", scope: !289, file: !290, line: 31, type: !300, isLocal: false, isDefinition: true)
!289 = distinct !DICompileUnit(language: DW_LANG_C99, file: !290, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !298, globals: !299, nameTableKind: None)
!290 = !DIFile(filename: "kp_kv_local.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!291 = !{!292, !5}
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "consistency_mode_enum", file: !293, line: 37, baseType: !7, size: 32, elements: !294)
!293 = !DIFile(filename: "./../include/kp_kv_master.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!294 = !{!295, !296, !297}
!295 = !DIEnumerator(name: "MODE_WEAK", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "MODE_SNAPSHOT", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "MODE_SEQUENTIAL", value: 2, isUnsigned: true)
!298 = !{!154, !155, !50}
!299 = !{!287}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 51, baseType: !7)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "kp_master_id_count", scope: !303, file: !304, line: 41, type: !300, isLocal: false, isDefinition: true)
!303 = distinct !DICompileUnit(language: DW_LANG_C99, file: !304, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !305, retainedTypes: !308, globals: !309, nameTableKind: None)
!304 = !DIFile(filename: "kp_kv_master.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!305 = !{!306, !5}
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "consistency_mode_enum", file: !307, line: 37, baseType: !7, size: 32, elements: !294)
!307 = !DIFile(filename: "../include/kp_kv_master.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!308 = !{!155, !154, !46, !157}
!309 = !{!301}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "mtm_tid", scope: !312, file: !313, line: 17, type: !46, isLocal: false, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !314, retainedTypes: !315, globals: !316, nameTableKind: None)
!313 = !DIFile(filename: "kp_common.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!314 = !{}
!315 = !{!155, !154, !97}
!316 = !{!310, !317, !319, !321, !323, !325, !327, !329, !331, !333, !335, !337, !339, !341, !343, !345, !347, !349, !351, !360, !365, !367, !371, !373, !375}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "tsz", scope: !312, file: !313, line: 20, type: !157, isLocal: false, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "tbuf_ptr", scope: !312, file: !313, line: 21, type: !157, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "n_tentry", scope: !312, file: !313, line: 27, type: !157, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "mtm_enable_trace", scope: !312, file: !313, line: 28, type: !46, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "tmp_enable_trace", scope: !312, file: !313, line: 28, type: !46, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "trace_marker", scope: !312, file: !313, line: 29, type: !46, isLocal: false, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "tracing_on", scope: !312, file: !313, line: 29, type: !46, isLocal: false, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "mtm_debug_buffer", scope: !312, file: !313, line: 30, type: !46, isLocal: false, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "start_buf_drain", scope: !312, file: !313, line: 32, type: !157, isLocal: false, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "end_buf_drain", scope: !312, file: !313, line: 32, type: !157, isLocal: false, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "buf_drain_period", scope: !312, file: !313, line: 32, type: !157, isLocal: false, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "glb_tv_sec", scope: !312, file: !313, line: 33, type: !157, isLocal: false, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "glb_tv_usec", scope: !312, file: !313, line: 33, type: !157, isLocal: false, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "glb_start_time", scope: !312, file: !313, line: 33, type: !157, isLocal: false, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "tot_epoch", scope: !312, file: !313, line: 34, type: !157, isLocal: false, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "reg_write", scope: !312, file: !313, line: 36, type: !46, isLocal: false, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "n_epoch", scope: !312, file: !313, line: 37, type: !157, isLocal: false, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "mtm_time", scope: !312, file: !313, line: 16, type: !353, isLocal: false, isDefinition: true)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !354, line: 30, size: 128, elements: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "")
!355 = !{!356, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !353, file: !354, line: 32, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !194, line: 139, baseType: !97)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !353, file: !354, line: 33, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !194, line: 141, baseType: !97)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "tstr", scope: !312, file: !313, line: 19, type: !362, isLocal: false, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1024, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 128)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "tbuf", scope: !312, file: !313, line: 24, type: !156, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "tbuf_lock", scope: !312, file: !313, line: 25, type: !369, isLocal: false, isDefinition: true)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_spinlock_t", file: !71, line: 234, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "tot_epoch_lock", scope: !312, file: !313, line: 25, type: !369, isLocal: false, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "tbuf_sz", scope: !312, file: !313, line: 26, type: !157, isLocal: false, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "glb_time", scope: !312, file: !313, line: 31, type: !353, isLocal: false, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "default_tuning", scope: !379, file: !380, line: 147, type: !386, isLocal: true, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !381, retainedTypes: !384, globals: !385, nameTableKind: None)
!380 = !DIFile(filename: "hash_table/hash.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!381 = !{!382}
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ds_state_enum", file: !383, line: 53, baseType: !7, size: 32, elements: !8)
!383 = !DIFile(filename: "hash_table/../kp_recovery.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!384 = !{!50, !154, !152, !155, !46, !157}
!385 = !{!377}
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !103, line: 77, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !103, line: 65, size: 160, elements: !389)
!389 = !{!390, !391, !392, !393, !394}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !388, file: !103, line: 70, baseType: !222, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !388, file: !103, line: 71, baseType: !222, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !388, file: !103, line: 72, baseType: !222, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !388, file: !103, line: 73, baseType: !222, size: 32, offset: 96)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !388, file: !103, line: 74, baseType: !57, size: 8, offset: 128)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "do_conflict_detection", scope: !397, file: !398, line: 34, type: !57, isLocal: false, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !399, retainedTypes: !407, globals: !494, nameTableKind: None)
!398 = !DIFile(filename: "evaluation/evaluation.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!399 = !{!400, !402}
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "consistency_mode_enum", file: !401, line: 37, baseType: !7, size: 32, elements: !294)
!401 = !DIFile(filename: "../include/../include/kp_kv_master.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !403, line: 175, baseType: !7, size: 32, elements: !404)
!403 = !DIFile(filename: "/usr/include/pthread.h", directory: "")
!404 = !{!405, !406}
!405 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0, isUnsigned: true)
!406 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1, isUnsigned: true)
!407 = !{!408, !154, !411, !46, !157, !412, !415, !155, !222, !156, !419, !420, !421, !432, !493, !152}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !409, line: 116, baseType: !410)
!409 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !194, line: 183, baseType: !156)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !49, line: 122, baseType: !50)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "kp_kv_master", file: !401, line: 23, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "kp_kv_master_struct", file: !401, line: 22, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "kp_kv_local", file: !417, line: 54, baseType: !418)
!417 = !DIFile(filename: "../include/../include/kp_kv_local.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "kp_kv_local_struct", file: !417, line: 53, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "benchmark_thread_args", file: !398, line: 122, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "benchmark_args_struct", file: !398, line: 110, size: 1472, elements: !424)
!424 = !{!425, !435, !436, !437, !438, !456, !480, !481, !482, !483, !484}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_set", scope: !423, file: !398, line: 111, baseType: !426, size: 1024)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpu_set_t", file: !427, line: 128, baseType: !428)
!427 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sched.h", directory: "")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 125, size: 1024, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__bits", scope: !428, file: !427, line: 127, baseType: !431, size: 1024)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 1024, elements: !433)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cpu_mask", file: !427, line: 118, baseType: !50)
!433 = !{!434}
!434 = !DISubrange(count: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !423, file: !398, line: 112, baseType: !154, size: 64, offset: 1024)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !423, file: !398, line: 113, baseType: !46, size: 32, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "starting_ops", scope: !423, file: !398, line: 114, baseType: !46, size: 32, offset: 1120)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bench_cond", scope: !423, file: !398, line: 115, baseType: !439, size: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !71, line: 154, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 139, size: 384, elements: !442)
!442 = !{!443, !454, !455}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !441, file: !71, line: 151, baseType: !444, size: 384)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !71, line: 141, size: 384, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !444, file: !71, line: 143, baseType: !46, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !444, file: !71, line: 144, baseType: !7, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !444, file: !71, line: 145, baseType: !157, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !444, file: !71, line: 146, baseType: !157, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !444, file: !71, line: 147, baseType: !157, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !444, file: !71, line: 148, baseType: !154, size: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !444, file: !71, line: 149, baseType: !7, size: 32, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !444, file: !71, line: 150, baseType: !7, size: 32, offset: 352)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !441, file: !71, line: 152, baseType: !256, size: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !441, file: !71, line: 153, baseType: !260, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bench_mutex", scope: !423, file: !398, line: 116, baseType: !457, size: 64, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !71, line: 128, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 90, size: 320, elements: !460)
!460 = !{!461, !478, !479}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !459, file: !71, line: 125, baseType: !462, size: 320)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !71, line: 92, size: 320, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !462, file: !71, line: 94, baseType: !46, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !462, file: !71, line: 95, baseType: !7, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !462, file: !71, line: 96, baseType: !46, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !462, file: !71, line: 98, baseType: !7, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !462, file: !71, line: 102, baseType: !46, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !462, file: !71, line: 104, baseType: !83, size: 16, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !462, file: !71, line: 105, baseType: !83, size: 16, offset: 176)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !462, file: !71, line: 106, baseType: !472, size: 128, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !71, line: 79, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !71, line: 75, size: 128, elements: !474)
!474 = !{!475, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !473, file: !71, line: 77, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !473, file: !71, line: 78, baseType: !476, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !459, file: !71, line: 126, baseType: !93, size: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !459, file: !71, line: 127, baseType: !97, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "slam_local", scope: !423, file: !398, line: 117, baseType: !57, size: 8, offset: 1280)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "split_keys", scope: !423, file: !398, line: 118, baseType: !57, size: 8, offset: 1288)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "my_id", scope: !423, file: !398, line: 119, baseType: !46, size: 32, offset: 1312)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "do_measure", scope: !423, file: !398, line: 120, baseType: !57, size: 8, offset: 1344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !423, file: !398, line: 121, baseType: !485, size: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "random_ints", file: !398, line: 107, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "random_ints_", file: !398, line: 103, size: 128, elements: !488)
!488 = !{!489, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !487, file: !398, line: 104, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !487, file: !398, line: 105, baseType: !7, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !487, file: !398, line: 106, baseType: !7, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!494 = !{!395, !495, !497, !499, !501, !503, !505, !507, !509, !511, !513, !515, !517, !519, !521, !523, !525, !527, !529, !531, !533, !535, !537, !539, !541, !543, !545, !547, !549, !551, !553, !555, !557, !559, !561, !564, !570, !572, !574, !584, !586, !588, !590, !592, !594, !596, !638, !640, !642, !644, !646, !648}
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "use_durable_ldb", scope: !397, file: !398, line: 35, type: !57, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "use_nvm_local", scope: !397, file: !398, line: 60, type: !57, isLocal: false, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "use_nvm_master", scope: !397, file: !398, line: 61, type: !57, isLocal: false, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "use_random_values", scope: !397, file: !398, line: 68, type: !57, isLocal: false, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "use_random_keys", scope: !397, file: !398, line: 69, type: !57, isLocal: false, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "use_rand", scope: !397, file: !398, line: 70, type: !57, isLocal: false, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "free_gotten_vals", scope: !397, file: !398, line: 71, type: !57, isLocal: false, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "use_get_workload", scope: !397, file: !398, line: 72, type: !57, isLocal: false, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "measure_only_get", scope: !397, file: !398, line: 73, type: !57, isLocal: false, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "NUM_CPUS", scope: !397, file: !398, line: 80, type: !46, isLocal: false, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "iterations", scope: !397, file: !398, line: 142, type: !46, isLocal: false, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "merge_every", scope: !397, file: !398, line: 143, type: !46, isLocal: false, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "key_size", scope: !397, file: !398, line: 144, type: !46, isLocal: false, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "value_size", scope: !397, file: !398, line: 145, type: !46, isLocal: false, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "put_probability", scope: !397, file: !398, line: 146, type: !222, isLocal: false, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "update_probability", scope: !397, file: !398, line: 147, type: !222, isLocal: false, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "UINT_64_ALMOST_MAX", scope: !397, file: !398, line: 150, type: !48, isLocal: false, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "operations", scope: !397, file: !398, line: 151, type: !46, isLocal: false, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "log_file_name", scope: !397, file: !398, line: 153, type: !156, isLocal: false, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "num_keys", scope: !397, file: !398, line: 158, type: !48, isLocal: false, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "thpt_numputs", scope: !397, file: !398, line: 159, type: !46, isLocal: false, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "thpt_numgets", scope: !397, file: !398, line: 160, type: !46, isLocal: false, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "thpt_numdels", scope: !397, file: !398, line: 161, type: !46, isLocal: false, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "thpt_numops", scope: !397, file: !398, line: 162, type: !46, isLocal: false, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "total_usecs", scope: !397, file: !398, line: 163, type: !46, isLocal: false, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "total_conflicts", scope: !397, file: !398, line: 164, type: !46, isLocal: false, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "total_commits", scope: !397, file: !398, line: 165, type: !46, isLocal: false, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "total_error_count", scope: !397, file: !398, line: 166, type: !46, isLocal: false, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "wp_numinsert", scope: !397, file: !398, line: 167, type: !46, isLocal: false, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "wp_numupdate", scope: !397, file: !398, line: 168, type: !46, isLocal: false, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "wp_numget", scope: !397, file: !398, line: 169, type: !46, isLocal: false, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "random_int_count", scope: !397, file: !398, line: 179, type: !7, isLocal: false, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "threads_working", scope: !397, file: !398, line: 1909, type: !7, isLocal: false, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "ops_remaining", scope: !397, file: !398, line: 1910, type: !563, isLocal: false, isDefinition: true)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !409, line: 197, baseType: !97)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "pause_flag", scope: !566, file: !398, line: 2097, type: !46, isLocal: true, isDefinition: true)
!566 = distinct !DISubprogram(name: "parse_arguments", scope: !398, file: !398, line: 2090, type: !567, scopeLine: 2093, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !397, retainedNodes: !314)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !46, !419, !490, !569, !490, !569, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "base_flag", scope: !566, file: !398, line: 2098, type: !46, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "cache_flag", scope: !566, file: !398, line: 2099, type: !46, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "long_options", scope: !566, file: !398, line: 2100, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 1792, elements: !126)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !578, line: 104, size: 256, elements: !579)
!578 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !577, file: !578, line: 106, baseType: !32, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !577, file: !578, line: 109, baseType: !46, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !577, file: !578, line: 110, baseType: !490, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !577, file: !578, line: 111, baseType: !46, size: 32, offset: 192)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "WHICH_STORAGE_PLATFORM", scope: !397, file: !398, line: 36, type: !46, isLocal: false, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "WHICH_KEY_VALUE_STORE", scope: !397, file: !398, line: 37, type: !46, isLocal: false, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "push_out_of_cache", scope: !397, file: !398, line: 67, type: !57, isLocal: false, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "max_kv_size", scope: !397, file: !398, line: 140, type: !7, isLocal: false, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "local_expected_max_keys", scope: !397, file: !398, line: 141, type: !152, isLocal: false, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "max_key", scope: !397, file: !398, line: 148, type: !48, isLocal: false, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "log_file", scope: !397, file: !398, line: 154, type: !598, isLocal: false, isDefinition: true)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !165, line: 48, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !167, line: 241, size: 1728, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !600, file: !167, line: 242, baseType: !46, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !600, file: !167, line: 247, baseType: !156, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !600, file: !167, line: 248, baseType: !156, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !600, file: !167, line: 249, baseType: !156, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !600, file: !167, line: 250, baseType: !156, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !600, file: !167, line: 251, baseType: !156, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !600, file: !167, line: 252, baseType: !156, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !600, file: !167, line: 253, baseType: !156, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !600, file: !167, line: 254, baseType: !156, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !600, file: !167, line: 256, baseType: !156, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !600, file: !167, line: 257, baseType: !156, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !600, file: !167, line: 258, baseType: !156, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !600, file: !167, line: 260, baseType: !615, size: 64, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !167, line: 156, size: 192, elements: !617)
!617 = !{!618, !619, !621}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !616, file: !167, line: 157, baseType: !615, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !616, file: !167, line: 158, baseType: !620, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !616, file: !167, line: 162, baseType: !46, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !600, file: !167, line: 262, baseType: !620, size: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !600, file: !167, line: 264, baseType: !46, size: 32, offset: 896)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !600, file: !167, line: 268, baseType: !46, size: 32, offset: 928)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !600, file: !167, line: 270, baseType: !193, size: 64, offset: 960)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !600, file: !167, line: 274, baseType: !196, size: 16, offset: 1024)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !600, file: !167, line: 275, baseType: !122, size: 8, offset: 1040)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !600, file: !167, line: 276, baseType: !199, size: 8, offset: 1048)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !600, file: !167, line: 280, baseType: !203, size: 64, offset: 1088)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !600, file: !167, line: 289, baseType: !206, size: 64, offset: 1152)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !600, file: !167, line: 297, baseType: !154, size: 64, offset: 1216)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !600, file: !167, line: 298, baseType: !154, size: 64, offset: 1280)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !600, file: !167, line: 299, baseType: !154, size: 64, offset: 1344)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !600, file: !167, line: 300, baseType: !154, size: 64, offset: 1408)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !600, file: !167, line: 302, baseType: !152, size: 64, offset: 1472)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !600, file: !167, line: 303, baseType: !46, size: 32, offset: 1536)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !600, file: !167, line: 305, baseType: !214, size: 160, offset: 1568)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "temp_value", scope: !397, file: !398, line: 172, type: !154, isLocal: false, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "dest_value", scope: !397, file: !398, line: 173, type: !154, isLocal: false, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "dest_values", scope: !397, file: !398, line: 175, type: !155, isLocal: false, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "temp_values", scope: !397, file: !398, line: 176, type: !155, isLocal: false, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "temp_keys", scope: !397, file: !398, line: 177, type: !419, isLocal: false, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "measurement_in_progress", scope: !397, file: !398, line: 180, type: !57, isLocal: false, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "pmp_mutex", scope: !652, file: !653, line: 6, type: !691, isLocal: false, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !314, retainedTypes: !654, globals: !671, nameTableKind: None)
!653 = !DIFile(filename: "clibpm.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!654 = !{!408, !154, !411, !46, !157, !655, !670}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clump", file: !657, line: 100, size: 512, elements: !658)
!657 = !DIFile(filename: "../include/clibpm.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !656, file: !657, line: 101, baseType: !152, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prevsize", scope: !656, file: !657, line: 102, baseType: !152, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !656, file: !657, line: 106, baseType: !662, size: 384, offset: 128)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 384, elements: !668)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !656, file: !657, line: 103, size: 128, elements: !664)
!664 = !{!665, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !663, file: !657, line: 104, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !165, line: 90, baseType: !193)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_", scope: !663, file: !657, line: 105, baseType: !154, size: 64, offset: 64)
!668 = !{!669}
!669 = !DISubrange(count: 3)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!671 = !{!672, !650, !674, !685, !687, !689}
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "prev_clp", scope: !652, file: !653, line: 415, type: !655, isLocal: false, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "sp", scope: !652, file: !653, line: 37, type: !676, isLocal: false, isDefinition: true)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_info", file: !657, line: 92, size: 32832, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !677, file: !657, line: 93, baseType: !7, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "itr", scope: !677, file: !657, line: 94, baseType: !7, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ptrs", scope: !677, file: !657, line: 95, baseType: !682, size: 32768, offset: 64)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 32768, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 512)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "pmem_debug", scope: !652, file: !653, line: 38, type: !46, isLocal: false, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "pmem_orig_size", scope: !652, file: !653, line: 39, type: !152, isLocal: false, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "pmp", scope: !652, file: !653, line: 106, type: !154, isLocal: false, isDefinition: true)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !71, line: 128, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 90, size: 320, elements: !693)
!693 = !{!694, !711, !712}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !692, file: !71, line: 125, baseType: !695, size: 320)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !71, line: 92, size: 320, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !695, file: !71, line: 94, baseType: !46, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !695, file: !71, line: 95, baseType: !7, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !695, file: !71, line: 96, baseType: !46, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !695, file: !71, line: 98, baseType: !7, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !695, file: !71, line: 102, baseType: !46, size: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !695, file: !71, line: 104, baseType: !83, size: 16, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !695, file: !71, line: 105, baseType: !83, size: 16, offset: 176)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !695, file: !71, line: 106, baseType: !705, size: 128, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !71, line: 79, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !71, line: 75, size: 128, elements: !707)
!707 = !{!708, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !706, file: !71, line: 77, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !706, file: !71, line: 78, baseType: !709, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !692, file: !71, line: 126, baseType: !93, size: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !692, file: !71, line: 127, baseType: !97, size: 64)
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !715, retainedTypes: !718, nameTableKind: None)
!714 = !DIFile(filename: "vector-cdds/vector.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!715 = !{!716}
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ds_state_enum", file: !717, line: 53, baseType: !7, size: 32, elements: !8)
!717 = !DIFile(filename: "vector-cdds/../kp_recovery.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!718 = !{!155, !154, !46, !157, !719, !50, !48}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !715, retainedTypes: !722, nameTableKind: None)
!721 = !DIFile(filename: "vector-cdds/vector64.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!722 = !{!155, !154, !50, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !314, retainedTypes: !726, nameTableKind: None)
!725 = !DIFile(filename: "threadpool/queue.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!726 = !{!155, !154}
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !314, retainedTypes: !729, nameTableKind: None)
!728 = !DIFile(filename: "threadpool/threadpool.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!729 = !{!730, !155, !154, !742}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "task", file: !728, line: 31, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_", file: !728, line: 27, size: 192, elements: !733)
!733 = !{!734, !740, !741}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !732, file: !728, line: 28, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "task_function", file: !737, line: 36, baseType: !738)
!737 = !DIFile(filename: "threadpool/threadpool.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!738 = !DISubroutineType(types: !739)
!739 = !{null, !154}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !732, file: !728, line: 29, baseType: !154, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvm", scope: !732, file: !728, line: 30, baseType: !57, size: 8, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "threadpool", file: !737, line: 14, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "threadpool_", file: !728, line: 13, size: 448, elements: !745)
!745 = !{!746, !751, !775, !793, !794, !795, !796, !797, !798, !799}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "task_queue", scope: !744, file: !728, line: 15, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "queue", file: !749, line: 22, baseType: !750)
!749 = !DIFile(filename: "threadpool/queue.h", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "_queue", file: !749, line: 21, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !744, file: !728, line: 16, baseType: !752, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !71, line: 128, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 90, size: 320, elements: !755)
!755 = !{!756, !773, !774}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !754, file: !71, line: 125, baseType: !757, size: 320)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !71, line: 92, size: 320, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !757, file: !71, line: 94, baseType: !46, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !757, file: !71, line: 95, baseType: !7, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !757, file: !71, line: 96, baseType: !46, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !757, file: !71, line: 98, baseType: !7, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !757, file: !71, line: 102, baseType: !46, size: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !757, file: !71, line: 104, baseType: !83, size: 16, offset: 160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !757, file: !71, line: 105, baseType: !83, size: 16, offset: 176)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !757, file: !71, line: 106, baseType: !767, size: 128, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !71, line: 79, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !71, line: 75, size: 128, elements: !769)
!769 = !{!770, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !768, file: !71, line: 77, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !768, file: !71, line: 78, baseType: !771, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !754, file: !71, line: 126, baseType: !93, size: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !754, file: !71, line: 127, baseType: !97, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "task_available", scope: !744, file: !728, line: 17, baseType: !776, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !71, line: 154, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !71, line: 139, size: 384, elements: !779)
!779 = !{!780, !791, !792}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !778, file: !71, line: 151, baseType: !781, size: 384)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !778, file: !71, line: 141, size: 384, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !781, file: !71, line: 143, baseType: !46, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !781, file: !71, line: 144, baseType: !7, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !781, file: !71, line: 145, baseType: !157, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !781, file: !71, line: 146, baseType: !157, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !781, file: !71, line: 147, baseType: !157, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !781, file: !71, line: 148, baseType: !154, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !781, file: !71, line: 149, baseType: !7, size: 32, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !781, file: !71, line: 150, baseType: !7, size: 32, offset: 352)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !778, file: !71, line: 152, baseType: !256, size: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !778, file: !71, line: 153, baseType: !260, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "exit_cond", scope: !744, file: !728, line: 18, baseType: !776, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "worker_exit", scope: !744, file: !728, line: 19, baseType: !57, size: 8, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "num_workers", scope: !744, file: !728, line: 20, baseType: !7, size: 32, offset: 288)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tasks_pending", scope: !744, file: !728, line: 21, baseType: !7, size: 32, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tasks_active", scope: !744, file: !728, line: 22, baseType: !7, size: 32, offset: 352)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tasks_completed", scope: !744, file: !728, line: 23, baseType: !7, size: 32, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvm", scope: !744, file: !728, line: 24, baseType: !57, size: 8, offset: 416)
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !314, retainedTypes: !802, nameTableKind: None)
!801 = !DIFile(filename: "kp_recovery.c", directory: "/home/aksun/git/NvmBenchmarks/echo/src")
!802 = !{!408, !154, !411, !46, !157, !803, !50, !48}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clump", file: !657, line: 100, size: 512, elements: !805)
!805 = !{!806, !807, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !804, file: !657, line: 101, baseType: !152, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "prevsize", scope: !804, file: !657, line: 102, baseType: !152, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !804, file: !657, line: 106, baseType: !809, size: 384, offset: 128)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 384, elements: !668)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !804, file: !657, line: 103, size: 128, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !810, file: !657, line: 104, baseType: !666, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_", scope: !810, file: !657, line: 105, baseType: !154, size: 64, offset: 64)
!814 = !{!"clang version 8.0.0 (tags/RELEASE_800/final)"}
!815 = !{i32 2, !"Dwarf Version", i32 4}
!816 = !{i32 2, !"Debug Info Version", i32 3}
!817 = !{i32 1, !"wchar_size", i32 4}
!818 = !{i32 7, !"PIC Level", i32 2}
!819 = distinct !DISubprogram(name: "kp_ht_hasher_djb2", scope: !3, file: !3, line: 261, type: !285, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!820 = !DILocalVariable(name: "entry_ptr", arg: 1, scope: !819, file: !3, line: 261, type: !271)
!821 = !DILocation(line: 261, column: 38, scope: !819)
!822 = !DILocalVariable(name: "table_size", arg: 2, scope: !819, file: !3, line: 261, type: !152)
!823 = !DILocation(line: 261, column: 56, scope: !819)
!824 = !DILocation(line: 266, column: 23, scope: !819)
!825 = !DILocalVariable(name: "entry", scope: !819, file: !3, line: 266, type: !27)
!826 = !DILocation(line: 266, column: 15, scope: !819)
!827 = !DILocation(line: 268, column: 7, scope: !828)
!828 = distinct !DILexicalBlock(scope: !819, file: !3, line: 268, column: 6)
!829 = !DILocation(line: 268, column: 6, scope: !819)
!830 = !DILocation(line: 269, column: 3, scope: !831)
!831 = distinct !DILexicalBlock(scope: !832, file: !3, line: 269, column: 3)
!832 = distinct !DILexicalBlock(scope: !828, file: !3, line: 268, column: 14)
!833 = !DILocation(line: 271, column: 3, scope: !832)
!834 = !DILocation(line: 275, column: 15, scope: !819)
!835 = !DILocalVariable(name: "key", scope: !819, file: !3, line: 264, type: !32)
!836 = !DILocation(line: 264, column: 14, scope: !819)
!837 = !DILocalVariable(name: "hash", scope: !819, file: !3, line: 265, type: !50)
!838 = !DILocation(line: 265, column: 16, scope: !819)
!839 = !DILocation(line: 278, column: 2, scope: !819)
!840 = !DILocation(line: 0, scope: !819)
!841 = !DILocation(line: 278, column: 19, scope: !819)
!842 = !DILocation(line: 278, column: 15, scope: !819)
!843 = !DILocalVariable(name: "c", scope: !819, file: !3, line: 263, type: !46)
!844 = !DILocation(line: 263, column: 6, scope: !819)
!845 = !DILocation(line: 279, column: 17, scope: !846)
!846 = distinct !DILexicalBlock(scope: !819, file: !3, line: 278, column: 25)
!847 = !DILocation(line: 279, column: 23, scope: !846)
!848 = !DILocation(line: 279, column: 33, scope: !846)
!849 = !DILocation(line: 279, column: 31, scope: !846)
!850 = distinct !{!850, !839, !851}
!851 = !DILocation(line: 280, column: 2, scope: !819)
!852 = !DILocation(line: 282, column: 14, scope: !819)
!853 = !DILocation(line: 284, column: 2, scope: !819)
!854 = !DILocation(line: 285, column: 1, scope: !819)
!855 = distinct !DISubprogram(name: "kp_ht_hasher_sdbm", scope: !3, file: !3, line: 232, type: !285, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!856 = !DILocalVariable(name: "entry_ptr", arg: 1, scope: !855, file: !3, line: 232, type: !271)
!857 = !DILocation(line: 232, column: 38, scope: !855)
!858 = !DILocalVariable(name: "table_size", arg: 2, scope: !855, file: !3, line: 232, type: !152)
!859 = !DILocation(line: 232, column: 56, scope: !855)
!860 = !DILocation(line: 237, column: 23, scope: !855)
!861 = !DILocalVariable(name: "entry", scope: !855, file: !3, line: 237, type: !27)
!862 = !DILocation(line: 237, column: 15, scope: !855)
!863 = !DILocation(line: 239, column: 7, scope: !864)
!864 = distinct !DILexicalBlock(scope: !855, file: !3, line: 239, column: 6)
!865 = !DILocation(line: 239, column: 6, scope: !855)
!866 = !DILocation(line: 240, column: 3, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 240, column: 3)
!868 = distinct !DILexicalBlock(scope: !864, file: !3, line: 239, column: 14)
!869 = !DILocation(line: 242, column: 3, scope: !868)
!870 = !DILocation(line: 246, column: 15, scope: !855)
!871 = !DILocalVariable(name: "key", scope: !855, file: !3, line: 235, type: !32)
!872 = !DILocation(line: 235, column: 14, scope: !855)
!873 = !DILocalVariable(name: "hash", scope: !855, file: !3, line: 236, type: !50)
!874 = !DILocation(line: 236, column: 16, scope: !855)
!875 = !DILocation(line: 250, column: 6, scope: !855)
!876 = !DILocalVariable(name: "c", scope: !855, file: !3, line: 234, type: !46)
!877 = !DILocation(line: 234, column: 6, scope: !855)
!878 = !DILocation(line: 251, column: 2, scope: !855)
!879 = !DILocation(line: 0, scope: !855)
!880 = !DILocation(line: 251, column: 11, scope: !855)
!881 = !DILocation(line: 252, column: 10, scope: !882)
!882 = distinct !DILexicalBlock(scope: !855, file: !3, line: 251, column: 20)
!883 = !DILocation(line: 252, column: 20, scope: !882)
!884 = !DILocation(line: 252, column: 12, scope: !882)
!885 = !DILocation(line: 252, column: 34, scope: !882)
!886 = !DILocation(line: 252, column: 26, scope: !882)
!887 = !DILocation(line: 252, column: 41, scope: !882)
!888 = !DILocation(line: 253, column: 6, scope: !882)
!889 = !DILocation(line: 254, column: 7, scope: !882)
!890 = distinct !{!890, !878, !891}
!891 = !DILocation(line: 255, column: 2, scope: !855)
!892 = !DILocation(line: 256, column: 14, scope: !855)
!893 = !DILocation(line: 258, column: 2, scope: !855)
!894 = !DILocation(line: 259, column: 1, scope: !855)
!895 = distinct !DISubprogram(name: "kp_ht_comparator", scope: !3, file: !3, line: 294, type: !896, scopeLine: 295, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!896 = !DISubroutineType(types: !897)
!897 = !{!57, !271, !271}
!898 = !DILocalVariable(name: "entry1_ptr", arg: 1, scope: !895, file: !3, line: 294, type: !271)
!899 = !DILocation(line: 294, column: 35, scope: !895)
!900 = !DILocalVariable(name: "entry2_ptr", arg: 2, scope: !895, file: !3, line: 294, type: !271)
!901 = !DILocation(line: 294, column: 59, scope: !895)
!902 = !DILocation(line: 296, column: 24, scope: !895)
!903 = !DILocalVariable(name: "entry1", scope: !895, file: !3, line: 296, type: !27)
!904 = !DILocation(line: 296, column: 15, scope: !895)
!905 = !DILocation(line: 297, column: 24, scope: !895)
!906 = !DILocalVariable(name: "entry2", scope: !895, file: !3, line: 297, type: !27)
!907 = !DILocation(line: 297, column: 15, scope: !895)
!908 = !DILocation(line: 298, column: 7, scope: !909)
!909 = distinct !DILexicalBlock(scope: !895, file: !3, line: 298, column: 6)
!910 = !DILocation(line: 298, column: 18, scope: !909)
!911 = !DILocation(line: 298, column: 14, scope: !909)
!912 = !DILocation(line: 299, column: 3, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 299, column: 3)
!914 = distinct !DILexicalBlock(scope: !909, file: !3, line: 298, column: 26)
!915 = !DILocation(line: 300, column: 3, scope: !914)
!916 = !DILocation(line: 304, column: 21, scope: !917)
!917 = distinct !DILexicalBlock(scope: !895, file: !3, line: 304, column: 6)
!918 = !DILocation(line: 304, column: 34, scope: !917)
!919 = !DILocation(line: 304, column: 6, scope: !917)
!920 = !DILocation(line: 304, column: 39, scope: !917)
!921 = !DILocation(line: 0, scope: !895)
!922 = !DILocation(line: 308, column: 1, scope: !895)
!923 = distinct !DISubprogram(name: "kp_ht_lock_vt", scope: !3, file: !3, line: 317, type: !924, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!924 = !DISubroutineType(types: !925)
!925 = !{!57, !271}
!926 = !DILocalVariable(name: "entry_ptr", arg: 1, scope: !923, file: !3, line: 317, type: !271)
!927 = !DILocation(line: 317, column: 32, scope: !923)
!928 = !DILocation(line: 319, column: 23, scope: !923)
!929 = !DILocalVariable(name: "entry", scope: !923, file: !3, line: 319, type: !27)
!930 = !DILocation(line: 319, column: 15, scope: !923)
!931 = !DILocation(line: 323, column: 7, scope: !932)
!932 = distinct !DILexicalBlock(scope: !923, file: !3, line: 323, column: 6)
!933 = !DILocation(line: 323, column: 6, scope: !923)
!934 = !DILocation(line: 324, column: 3, scope: !935)
!935 = distinct !DILexicalBlock(scope: !936, file: !3, line: 324, column: 3)
!936 = distinct !DILexicalBlock(scope: !932, file: !3, line: 323, column: 14)
!937 = !DILocation(line: 325, column: 3, scope: !936)
!938 = !DILocation(line: 327, column: 14, scope: !939)
!939 = distinct !DILexicalBlock(scope: !923, file: !3, line: 327, column: 6)
!940 = !DILocation(line: 327, column: 7, scope: !939)
!941 = !DILocation(line: 327, column: 6, scope: !923)
!942 = !DILocation(line: 334, column: 3, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 334, column: 3)
!944 = distinct !DILexicalBlock(scope: !939, file: !3, line: 327, column: 18)
!945 = !DILocation(line: 335, column: 3, scope: !944)
!946 = !DILocation(line: 342, column: 42, scope: !923)
!947 = !DILocation(line: 342, column: 46, scope: !923)
!948 = !DILocation(line: 342, column: 2, scope: !923)
!949 = !DILocation(line: 343, column: 2, scope: !923)
!950 = !DILocation(line: 0, scope: !923)
!951 = !DILocation(line: 344, column: 1, scope: !923)
!952 = distinct !DISubprogram(name: "kp_ht_entry_is_reset", scope: !3, file: !3, line: 349, type: !953, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!953 = !DISubroutineType(types: !954)
!954 = !{!57, !27}
!955 = !DILocalVariable(name: "entry", arg: 1, scope: !952, file: !3, line: 349, type: !27)
!956 = !DILocation(line: 349, column: 40, scope: !952)
!957 = !DILocation(line: 351, column: 6, scope: !958)
!958 = distinct !DILexicalBlock(scope: !952, file: !3, line: 351, column: 6)
!959 = !DILocation(line: 351, column: 6, scope: !952)
!960 = !DILocation(line: 352, column: 14, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 352, column: 7)
!962 = distinct !DILexicalBlock(scope: !958, file: !3, line: 351, column: 13)
!963 = !DILocation(line: 352, column: 18, scope: !961)
!964 = !DILocation(line: 352, column: 26, scope: !961)
!965 = !DILocation(line: 352, column: 36, scope: !961)
!966 = !DILocation(line: 352, column: 39, scope: !961)
!967 = !DILocation(line: 352, column: 7, scope: !962)
!968 = !DILocation(line: 357, column: 2, scope: !952)
!969 = !DILocation(line: 0, scope: !952)
!970 = !DILocation(line: 358, column: 1, scope: !952)
!971 = distinct !DISubprogram(name: "kp_ht_entry_set", scope: !3, file: !3, line: 377, type: !972, scopeLine: 379, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!972 = !DISubroutineType(types: !973)
!973 = !{!46, !27, !32, !36, !57, !57}
!974 = !DILocalVariable(name: "use_nvm", arg: 5, scope: !971, file: !3, line: 378, type: !57)
!975 = !DILocation(line: 378, column: 23, scope: !971)
!976 = !DILocalVariable(name: "entry", arg: 1, scope: !971, file: !3, line: 377, type: !27)
!977 = !DILocation(line: 377, column: 34, scope: !971)
!978 = !DILocalVariable(name: "key", arg: 2, scope: !971, file: !3, line: 377, type: !32)
!979 = !DILocation(line: 377, column: 53, scope: !971)
!980 = !DILocalVariable(name: "vt", arg: 3, scope: !971, file: !3, line: 377, type: !36)
!981 = !DILocation(line: 377, column: 65, scope: !971)
!982 = !DILocalVariable(name: "copy_key", arg: 4, scope: !971, file: !3, line: 378, type: !57)
!983 = !DILocation(line: 378, column: 8, scope: !971)
!984 = !DILocalVariable(name: "len", scope: !971, file: !3, line: 380, type: !152)
!985 = !DILocation(line: 380, column: 9, scope: !971)
!986 = !DILocation(line: 382, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !971, file: !3, line: 382, column: 6)
!988 = !DILocation(line: 382, column: 17, scope: !987)
!989 = !DILocation(line: 382, column: 13, scope: !987)
!990 = !DILocation(line: 383, column: 3, scope: !991)
!991 = distinct !DILexicalBlock(scope: !992, file: !3, line: 383, column: 3)
!992 = distinct !DILexicalBlock(scope: !987, file: !3, line: 382, column: 22)
!993 = !DILocation(line: 384, column: 3, scope: !992)
!994 = !DILocation(line: 387, column: 8, scope: !971)
!995 = !DILocation(line: 388, column: 10, scope: !996)
!996 = distinct !DILexicalBlock(scope: !971, file: !3, line: 388, column: 6)
!997 = !DILocation(line: 388, column: 6, scope: !971)
!998 = !DILocation(line: 389, column: 3, scope: !999)
!999 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 389, column: 3)
!1000 = distinct !DILexicalBlock(scope: !996, file: !3, line: 388, column: 16)
!1001 = !DILocation(line: 390, column: 3, scope: !1000)
!1002 = !DILocation(line: 398, column: 6, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !971, file: !3, line: 398, column: 6)
!1004 = !DILocation(line: 398, column: 6, scope: !971)
!1005 = !DILocation(line: 401, column: 32, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 398, column: 16)
!1007 = !DILocation(line: 401, column: 41, scope: !1006)
!1008 = !DILocation(line: 401, column: 3, scope: !1006)
!1009 = !DILocation(line: 402, column: 14, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 402, column: 7)
!1011 = !DILocation(line: 402, column: 18, scope: !1010)
!1012 = !DILocation(line: 402, column: 7, scope: !1006)
!1013 = !DILocation(line: 403, column: 4, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 403, column: 4)
!1015 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 402, column: 27)
